Emacs.org
#+TITLE: Emacs config

* Preface
Currently running a bit of a cowboy setup with a manually maintaned
packages.el file that pulls certain packages from git based on specific
digests and other from the package repositories using the emacs package
manager. It's bound to end in tears.

This approach to configuration is influenced very much by David Wilson
from system crafters. It is centered around literate programming and
functional package management.

* Startup Performance
#+begin_src emacs-lisp :tangle emacs/.emacs.d/init.el

  ;; init.el --- -*- lexical-binding: t; -*-

  ;; The default is 800 kilobytes. Measured in bytes.
  (setq gc-cons-threshold (* 50 1000 1000))

  ; Profile emacs startup
  (add-hook 'emacs-startup-hook
            (lambda ()
              (message "*** Emacs loaded in %s with %d garbage collections."
                       (format "%.2f seconds"
                               (float-time
                                (time-subtract after-init-time before-init-time)))
                       gcs-done)))
#+end_src

* Packages
** Old package managment with package.el
     
NOTE: tangle is disabled, chunk here for reference purposes
#+begin_src emacs-lisp 

  (make-directory (locate-user-emacs-file "local") :no-error)
  (add-to-list 'load-path "~/.emacs.d/lisp")
  (add-to-list 'Load-path
               (format "~/.emacs.d/site-lisp/%s" emacs-version))
  (add-to-list 'load-path
               (format "~/.emacs.d/site-lisp/%s/lisp" emacs-version))
  (add-to-list 'load-path
               (format "~/.emacs.d/site-lisp/%s/etc" emacs-version))


  (add-to-list 'load-path 
               (format "~/.emacs.d/site-lisp/%s/dash" emacs-version))
  (add-to-list 'load-path 
               (format "~/.emacs.d/site-lisp/%s/transient/lisp" emacs-version))
  (add-to-list 'load-path 
               (format "~/.emacs.d/site-lisp/%s/with-editor" emacs-version))
  (add-to-list 'load-path 
               (format "~/.emacs.d/site-lisp/%s/magit/lisp" emacs-version))

  (with-eval-after-load 'info
    (info-initialize)
    (add-to-list 'Info-directory-list
                 (format "~/.emacs.d/site-lisp/%s/magit/Documentation/" emacs-version)))
               
  (load-file "~/.emacs.d/packages.el")
  (require 'autoloads)
  (setf package-enable-at-startup nil)
  (require 'use-package)

  (setq package-archives '(("melpa" . "https://melpa.org/packages/")
                           ("org" . "https://orgmode.org/elpa/")
                           ("elpa" . "https://elpa.gnu.org/packages/")))
#+end_src

** Straight.el
Replacement for package.el. Functional package manager for emacs 

#+begin_src emacs-lisp :tangle emacs/.emacs.d/init.el
  ;; bootstrap straight.el
     (defvar bootstrap-version)
  (let ((bootstrap-file
         (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
        (bootstrap-version 5))
    (unless (file-exists-p bootstrap-file)
      (with-current-buffer
          (url-retrieve-synchronously
           "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
           'silent 'inhibit-cookies)
        (goto-char (point-max))
        (eval-print-last-sexp)))
    (load bootstrap-file nil 'nomessage)) 

  ;; Emacs version >= 27
  (setq package-enable-at-startup nil)

  ;; Use by default
  (straight-use-package 'use-package)

  ;; Saves typing `:straight t` after every use-package expression  
  (setq straight-use-package-by-default t)

  ;; Clean up unused repos with `straight-remove-unused-repos'

  ;; grab the right version of org
  (straight-use-package 'org)
#+end_src
* Keep .emacs.d Clean
As seen on tv, basically moves any transitory files that are normally
plonked in the .emacs.d directory to another location
#+begin_src emacs-lisp :tangle emacs/.emacs.d/init.el
;; Change the user-emacs-directory to keep unwanted things out of ~/.emacs.d
(setq user-emacs-directory (expand-file-name "~/.cache/emacs/")
      url-history-file (expand-file-name "url/history" user-emacs-directory))

;; Use no-littering to automatically set common paths to the new user-emacs-directory
(use-package no-littering
  :straight t)

;; Keep customization settings in a temporary file (thanks Ambrevar!)
(setq custom-file
      (if (boundp 'server-socket-dir)
          (expand-file-name "custom.el" server-socket-dir)
        (expand-file-name (format "emacs-custom-%s.el" (user-uid)) temporary-file-directory)))
(load custom-file t)
#+end_src
* Update Load Path 

** mu4e requires the following dependencies
#+begin_src conf :tangle .config/debian/manifests/dependencies
libgmime-3.0-dev
libxapian-dev
#+end_src

#+begin_src emacs-lisp :tangle emacs/.emacs.d/init.el
  (push "~/.emacs.d/lisp" load-path)  
  (require 'unannoy)
  (require 'ad-mail)
  (require 'mu4e)
#+end_src
* Default Coding System
use utf-8
#+begin_src emacs-lisp :tangle emacs/.emacs.d/init.el
(set-default-coding-systems 'utf-8)
#+end_src
* Start server
  #+begin_src emacs-lisp :tangle emacs/.emacs.d/init.el
  (server-start)
  #+end_src
* Keybindings
<<<<<<< Updated upstream

** Rebind the universal argument key 
Evil is using C-u for scrolling, so this needs to be rebound to another variable.
=======
#+begin_src emacs-lisp :tangle emacs/.emacs.d/init.el
(global-set-key (kbd "C-x k") #'kill-this-buffer)
#+end_src

** Rebind universal argument key

>>>>>>> Stashed changes
#+begin_src emacs-lisp :tangle emacs/.emacs.d/init.el
(global-set-key (kbd "C-M-u") 'universal-argument)
#+end_src

<<<<<<< Updated upstream
=======

>>>>>>> Stashed changes
* Global settings

#+begin_src emacs-lisp :tangle emacs/.emacs.d/init.el

;; Some global keybindings
(column-number-mode)
(global-display-line-numbers-mode t)

;; Global line width
(setq-default fill-column 80)

;;; auto-mode-alist entries
(add-to-list 'auto-mode-alist '("\\.mom$" . nroff-mode))
(add-to-list 'auto-mode-alist '("[._]bash.*" . shell-script-mode))
(add-to-list 'auto-mode-alist '("Cask" . emacs-lisp-mode))
(add-to-list 'auto-mode-alist '("[Mm]akefile" . makefile-gmake-mode))
(add-to-list 'auto-mode-alist '("\\.mak$" . makefile-gmake-mode))
(add-to-list 'auto-mode-alist '("\\.make$" . makefile-gmake-mode))
#+end_src

* User Interface
** unannoy 

#+begin_src emacs-lisp :tangle emacs/.emacs.d/lisp/unannoy.el
  ;;; unannoy.el --- disable Emacs' annoying bits
  ;;; originally written by nullprogram (Chris Wellons)

  ;;; Code:
  (setf backup-inhibited t
        auto-save-default nil
        auto-save-list-file-prefix (locate-user-emacs-file "local/saves")
        inhibit-startup-message t
        initial-scratch-message nil
        wdired-allow-to-change-permissions t
        echo-keystrokes 0.1
        delete-active-region nil
        disabled-command-function nil
        custom-file (make-temp-file "emacs-custom")
        large-file-warning-threshold 536870911
        gc-cons-threshold (* 1024 1024 32)
        vc-display-status nil
        ring-bell-function (lambda ()))

  ;; GUIs are for newbs
  (menu-bar-mode -1)
  (if (fboundp 'tool-bar-mode) (tool-bar-mode -1))
  (if (fboundp 'scroll-bar-mode) (scroll-bar-mode -1))

  ;; Too distracting
  (blink-cursor-mode -1)

  ;; I never want to use this
  (when (fboundp 'set-horizontal-scroll-bar-mode)
    (set-horizontal-scroll-bar-mode nil))

  ;; Do sensible clipboard things, please
  (setf select-enable-clipboard nil
        select-enable-primary t
        mouse-drag-copy-region t
        mouse-yank-at-point t)

  ;; Lexical binding by default. Must be delayed since Emacs sets this
  ;; on its own to nil after initialization.
  (run-at-time 0 nil (lambda ()
                       (setq-default lexical-binding t)))

  ;; Tabs suck
  (setq-default indent-tabs-mode nil)

  ;; I hate typing
  (defalias 'yes-or-no-p 'y-or-n-p)

  ;; Always use the one true encoding
  (prefer-coding-system 'utf-8-unix)

  ;; Insert key is stupid
  (define-key global-map [(insert)] nil)
  (define-key global-map [(control insert)] 'overwrite-mode)

  ;; I hate hitting this by accident
  (global-set-key (kbd "C-<up>") #'previous-line)
  (global-set-key (kbd "C-<down>") #'next-line)

  ;; Magit is the only front-end I care about
  (setf vc-handled-backends nil
        vc-follow-symlinks t)

  ;; Stop scrolling by huge leaps
  (setq mouse-wheel-scroll-amount '(1 ((shift) . 1))
        scroll-conservatively most-positive-fixnum
        scroll-preserve-screen-position t)

  (provide 'unannoy)
#+end_src

* Look and feel
** Theme 

Going to try out these snazzy looking doom themes.
#+begin_src emacs-lisp :tangle emacs/.emacs.d/init.el
  (use-package spacegray-theme
    :defer t)

  (use-package doom-themes
    :ensure t
    :config
    ;; Global settings (defaults)
    (setq doom-themes-enable-bold t
          doom-themes-enable-italic t)
    (load-theme 'doom-nord t)

    ;; Enable flashing mode-line on errors
    (doom-themes-visual-bell-config)
    ;; treemacs 
    (setq doom-themes-treemacs-theme "doom-atom") ; use "doom-colors for less minimal icon theme
    (doom-themes-treemacs-config)
    ;; Corrects (and improves) org-mode's native fontification.
    (doom-themes-org-config))

#+end_src

sanityinc was the theme that I had been using, leaving it here for a minute.
#+begin_src emacs-lisp 
  (use-package color-theme-sanityinc-tomorrow
    :config
    (setf custom-safe-themes t)
    (color-theme-sanityinc-tomorrow-night)
    (global-hl-line-mode 1)
    (custom-set-faces
     '(cursor ((t :background "#eebb28")))))
#+end_src

** Font

This function needs to run after the doom-theme has been loaded
#+begin_src emacs-lisp :tangle emacs/.emacs.d/init.el
  (custom-set-faces
   `(mode-line ((t (:background ,(doom-color 'dark-violet)))))
   `(font-lock-comment-face ((t (:foreground ,(doom-color 'base6))))))
#+end_src



#+begin_src emacs-lisp

  ;; Frames and fonts
  ;; currently disabled

  (defvar my-preferred-fonts
    '("Noto Mono-10"
      "Inconsolata-12"))

  (defun my-set-preferred-font (&optional frame)
    "Set the first available font from `my-preferred-fonts'."
    (catch 'done
      (with-selected-frame (or frame (selected-frame))
        (dolist (font my-preferred-fonts)
          (when (ignore-errors (x-list-fonts font))
            (set-frame-font font)
            (throw 'done nil))))))

  (defun my-set-frame-fullscreen (&optional frame)
    (set-frame-parameter frame 'fullscreen 'fullheight))

  (add-hook 'after-make-frame-functions #'my-set-preferred-font)
  (add-hook 'after-make-frame-functions #'my-set-frame-fullscreen t)

#+end_src

