Emacs.org
** Mode line

#+begin_src emacs-lisp :tangle emacs/.emacs.d/init.el
      (use-package all-the-icons
        :if (display-graphic-p))

      ;; You must run (all-the-icons-install-fonts) one time after installing
      ;; this package
      (use-package minions
        :hook (doom-modeline-mode . minions-mode))

      (use-package doom-modeline
        :after eshell
        :hook (after-init . doom-modeline-init)
        :custom-face
        (mode-line ((t (:height 0.85))))
        (mode-line-intactive ((t (:height 0.85))))
        :custom
        (doom-modeline-height 15)
        (doom-modeline-bar-width 6)
        (doom-modeline-lsp t)
        (doom-modeline-github nil)
        (doom-modeline-mu4e t)
        (doom-modeline-irc nil)
        (doom-modeline-persp-name nil)
        (doom-modeline-buffer-file.name-style 'truncate-except-project)
        (doom-modeline-major-mode-icon nil))
#+end_src


** Calender and planner notification stuff
#+begin_src emacs-lisp :tangle emacs/.emacs.d/init.el

  ;; Calendar and planner notification stuff
  (appt-activate t)
#+end_src

** Set margins (center)
#+begin_src emacs-lisp :tangle emacs/.emacs.d/init.el
(use-package visual-fill-column
  :config
  (setq visual-fill-column-width 110
        visual-fill-column-center-text t))
#+end_src
  
* Usability
** Dired
    
Use dired for searching directories 

#+begin_src emacs-lisp :tangle emacs/.emacs.d/init.el
  (use-package all-the-icons-dired)

  (straight-use-package '(dired :type built-in))
  (use-package dired
    :config
    (progn
      (add-hook 'dired-mode-hook #'toggle-truncate-lines)
      (setf dired-listing-switches "-alhG"
            dired-guess-shell-alist-user
            '(("\\.pdf\\'" "evince")
              ("\\(\\.ods\\|\\.xlsx?\\|\\.docx?\\|\\.csv\\)\\'" "libreoffice")
              ("\\(\\.png\\|\\.jpe?g\\)\\'" "qiv")
              ("\\.gif\\'" "animate")))))
#+end_src

** Evil
    
Evil mode get setup some vim style keybindings 
#+begin_src emacs-lisp :tangle emacs/.emacs.d/init.el
  (use-package evil
    :init
    (setq evil-want-integration t)
    (setq evil-want-keybinding nil)
    (setq evil-want-C-u-scroll t)
    (setq evil-want-C-i-jump nil)
    :config
    (evil-mode 1)
    (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)
    (define-key evil-insert-state-map (kbd "C-h") 'evil-delete-backward-char-and-join)

    ;; Use visual line motions even outside of visual-line-mode buffers
    (evil-global-set-key 'motion "j" 'evil-next-visual-line)
    (evil-global-set-key 'motion "k" 'evil-previous-visual-line)

    (evil-set-initial-state 'messages-buffer-mode 'normal)
    (evil-set-initial-state 'dashboard-mode 'normal))

  (use-package evil-collection
    :after evil
    :config
    (evil-collection-init))

  (use-package paren
    :config (show-paren-mode))

  (use-package rainbow-delimiters
    :defer t
    :init
    (add-hook 'emacs-lisp-mode-hook #'rainbow-delimiters-mode)
    (add-hook 'ielm-mode-hook #'rainbow-delimiters-mode)
    :config
    (set-face-foreground 'rainbow-delimiters-depth-1-face "snow4")
    (setf rainbow-delimiters-max-face-count 1)
    (set-face-attribute 'rainbow-delimiters-unmatched-face nil
                        :foreground 'unspecified
                        :inherit 'error)
    (set-face-foreground 'rainbow-delimiters-depth-1-face "snow4"))

  (use-package rainbow-mode
    :defer t
    :hook (org-mode
           emacs-lisp-mode
           web-mode
           typescript-mode
           js2-mode))


  (use-package javadoc-lookup
    :defer t
    :bind ("C-h j" . javadoc-lookup)
    :config
    (ignore-errors
      (setf javadoc-lookup-cache-dir (locate-user-emacs-file "local/javadoc"))))

  (use-package browse-url
    :defer t
    :init
    (setf url-cache-directory (locate-user-emacs-file "local/url"))
    :config
    (when (executable-find "firefox")
      (setf browse-url-browser-function #'browse-url-firefox)))
#+end_src

** Buffler
[[https://github.com/alphapapa/bufler.el][Buffler]] is a butler for buffers. Helps with organizing buffers according 
to a set of grouping rules.
#+begin_src emacs-lisp :tangle emacs/.emacs.d/init.el
  (use-package bufler
    :disabled
    :config
    (evil-collection-define-key 'normal 'bufler-list-mode-map
         (kbd "RET") 'bufler-list-buffer-switch
         (kbd "M-RET") 'bufler-list-buffer-peek
         "D" 'bufler-list-buffer-kill)
    (setf bufler-groups
          (bufler-defgroups
           ;; Subgroup collecting all named workspaces
           (group (auto-workspace))
           ;; Subgoup collecting buffers in a projectile project.
           (group (auto-projectile))
           (group
              ;; Group all 
            (group-or "Help/Info"
                       (mode-match "*Help*" (rx bos (or "help-" "helpful-")))
                       (mode-match "*Info*" (rx bos "info-"))))
           (group
            ;; Collect all special buffers
             (group-and "*Special*"
                        (name-match "**Special**"
                                    (rx bos "*" (or "Messages" "Warnings" "scratch" "Backtrace" "Pinentry") "*"))
                        (lambda (buffer)
                          (unless (or (funcall (mode-match "Magit" (rx bos "magit-status"))
                                               buffer)
                                      (funcall (mode-match "Dired" (rx bos "dired"))
                                               buffer)
                                      (funcall (auto-file) buffer))
                            "*Special*"))))
            ;; group remaining buffers by major mode
           (auto-mode))))
#+end_src
* Org
#+begin_src emacs-lisp :tangle emacs/.emacs.d/init.el

  ;; Org mode
  (use-package org 
    :defer t
    :after (org-roam ob-go) 
    :custom
    (org-format-latex-options (plist-put org-format-latex-options :scale 2.0))
    :config
    (add-hook 'org-mode-hook
              (lambda () (add-hook 'after-save-hook #'org-babel-tangle
                                   :append :local)))

  ;; todo-keywords
    (setq org-todo-keywords
          '((sequence "TODO" "IN-PROGRESS" "WAITING" "DONE")))
  ;; org babel

    (org-babel-do-load-languages
     'org-babel-load-languages
     '((emacs-lisp . t)
       (python . t)
       (C . t)
       (scheme . t)
       (ruby . t)
       (go . t)
       (gnuplot . t)
       (dot . t)
       (shell . t)))

    (push '("conf-unix" . conf-unix) org-src-lang-modes)

    (setq org-refile-targets '((nil :maxlevel . 1)
                           (org-agenda-files :maxlevel . 1)))

    ;; Capture templates
    (setq org-capture-templates
          '(("w" "Work Todo" entry (file+headline "~/Documents/org/Planner-mdw2022.org" "Tasks")
             "* TODO %?\n %i\n %a")
            ("h" "Home Todo" entry (file+headline "~/Documents/org/Planner-home2022.org" "Tasks")
             "* TODO %?\n %i\n %a")))
    (setq org-startup-folded "overview"))

  (require 'org-tempo)
  (add-to-list 'org-structure-template-alist '("dot" . "src dot"))
  (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
  (add-to-list 'org-structure-template-alist '("gnpl" . "src gnuplot"))
  (add-to-list 'org-structure-template-alist '("go" . "src go"))
  (add-to-list 'org-structure-template-alist '("js" . "src javascript"))
  (add-to-list 'org-structure-template-alist '("krc" . "src C"))
  (add-to-list 'org-structure-template-alist '("py" . "src python"))
  (add-to-list 'org-structure-template-alist '("rb" . "src ruby"))
  (add-to-list 'org-structure-template-alist '("scm" . "src scheme"))
  (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
  (add-to-list 'org-structure-template-alist '("sql" . "src sql"))
  (add-to-list 'org-structure-template-alist '("yml" . "src yaml"))

#+end_src

