Emacs.org
** Org Roam

This is a bit of a hack for getting the org-roam-node-list function to work.
Currently there seems to be a problem with the way autoload works with org-roam
functions. We need the org-roam-node-list function in order to query the db for
all nodes that contain the Project tag. This chunk below just copies out the function
verbatim and calls it at runtime rather than trying to use the missing byte-compiled
version.
#+begin_src emacs-lisp :tangle emacs/.emacs.d/init.el 
  (defun my/org-roam-node-list ()
    "Return all nodes stored in the database as a list of `org-roam-node's."
    (let ((rows (org-roam-db-query
                 "SELECT
    id,
    file,
    filetitle,
    \"level\",
    todo,
    pos,
    priority ,
    scheduled ,
    deadline ,
    title,
    properties ,
    olp,
    atime,
    mtime,
    '(' || group_concat(tags, ' ') || ')' as tags,
    aliases,
    refs
  FROM
    (
    SELECT
      id,
      file,
      filetitle,
      \"level\",
      todo,
      pos,
      priority ,
      scheduled ,
      deadline ,
      title,
      properties ,
      olp,
      atime,
      mtime,
      tags,
      '(' || group_concat(aliases, ' ') || ')' as aliases,
      refs
    FROM
      (
      SELECT
        nodes.id as id,
        nodes.file as file,
        nodes.\"level\" as \"level\",
        nodes.todo as todo,
        nodes.pos as pos,
        nodes.priority as priority,
        nodes.scheduled as scheduled,
        nodes.deadline as deadline,
        nodes.title as title,
        nodes.properties as properties,
        nodes.olp as olp,
        files.atime as atime,
        files.mtime as mtime,
        files.title as filetitle,
        tags.tag as tags,
        aliases.alias as aliases,
        '(' || group_concat(RTRIM (refs.\"type\", '\"') || ':' || LTRIM(refs.ref, '\"'), ' ') || ')' as refs
      FROM nodes
      LEFT JOIN files ON files.file = nodes.file
      LEFT JOIN tags ON tags.node_id = nodes.id
      LEFT JOIN aliases ON aliases.node_id = nodes.id
      LEFT JOIN refs ON refs.node_id = nodes.id
      GROUP BY nodes.id, tags.tag, aliases.alias )
    GROUP BY id, tags )
  GROUP BY id")))
      (cl-loop for row in rows
               append (pcase-let* ((`(,id ,file ,file-title ,level ,todo ,pos ,priority ,scheduled ,deadline
                                          ,title ,properties ,olp ,atime ,mtime ,tags ,aliases ,refs)
                                    row)
                                   (all-titles (cons title aliases)))
                        (mapcar (lambda (temp-title)
                                  (org-roam-node-create :id id
                                                        :file file
                                                        :file-title file-title
                                                        :file-atime atime
                                                        :file-mtime mtime
                                                        :level level
                                                        :point pos
                                                        :todo todo
                                                        :priority priority
                                                        :scheduled scheduled
                                                        :deadline deadline
                                                        :title temp-title
                                                        :aliases aliases
                                                        :properties properties
                                                        :olp olp
                                                        :tags tags
                                                        :refs refs))
                                all-titles)))))
#+end_src

#+begin_src emacs-lisp :tangle emacs/.emacs.d/init.el 

      (defun my/org-roam-filter-by-tag (tag-name)
        (lambda (node)
          (member tag-name (org-roam-node-tags node))))

      (defun my/org-roam-list-notes-by-tag (tag-name)
        (mapcar #'org-roam-node-file
                (seq-filter
                 (my/org-roam-filter-by-tag tag-name)
                 (my/org-roam-node-list))))

      (defun my/org-roam-refresh-agenda-list ()
        (interactive)
        (setq org-agenda-files (my/org-roam-list-notes-by-tag "Project")))


      (use-package org-roam
        :demand t
        :straight t
        :init 
        (setq org-roam-v2-ack t)
        :custom
        (org-roam-directory "~/Notes/org-roam/")
        (org-roam-dailies-directory "journal/")
        (org-roam-completion-everywhere t)
        (org-roam-capture-templates
         '(("d" "default" plain
            "%?"
            :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org"
                               "#+title: ${title}\n")
            :unnarrowed t)
           ("b" "book notes" plain
            "\n* Source\n\nAuthor: %^{Author}\nTitle: ${title}\nYear: %^{Year}\n\n* Summary\n\n%?"
            :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org"
                               "#+title: ${title}\n")
            :unnarrowed t)
           ("p" "project" plain 
            "* Goals\n\n%?\n\n* Tasks\n\n** TODO Add initial tasks\n\n** Dates\n\n"
            :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org"
                               "#+title: ${title}\n#+filetags: Project\n")
            :unnarrowed t)))
        (org-roam-dailies-capture-templates
         '(("d" "default" plain 
            "\n* Thanks\n\n %?\n\n* WorkingOn\n\n* WorkingTowards\n\n* Excited About\n\n* Woes\n\n* Ideas\n\n* Housekeeping\n\n* Family Planning\n\n* Thanks"
            :if-new (file+head "%<%Y-%m-%d>.org"
                               "#+title: %<%Y-%m-%d>\n")
            :unnarrowed t)))
        :bind (("C-c n l" . org-roam-buffer-toggle)
               ("C-c n f" . org-roam-node-find)
               ("C-c n c" . org-roam-dailies-capture-today)
               :map org-mode-map
               (("C-c n i" . org-roam-node-insert)
               ("C-M-i" . completion-at-point)))
        :config
        (org-roam-db-autosync-mode)
        (my/org-roam-refresh-agenda-list))
#+end_src

** Presentations
*** org-present
#+begin_src emacs-lisp :tangle emacs/.emacs.d/init.el

;; center the screen

(defun ad/org-present-start ()
;; Tweak font sizes
  (setq-local face-remapping-alist '((default (:height 1.5) variable-pitch)
                                     (header-line (:height 4.0) variable-pitch)
                                     (org-document-title (:height 1.75) org-document-title)
                                     (org-code (:height 1.55) org-code)
                                     (org-verbatim (:height 1.55) org-verbatim)
                                     (org-block (:height 1.25) org-block)
                                     (org-block-begin-line (:height 0.7) org-block)))
  ;; Center the presentation and wrap lines
  (visual-fill-column-mode 1)
  (visual-line-mode 1))

(defun ad/org-present-end ()
  (visual-fill-column-mode 0)
  (visual-line-mode 0))
  
(use-package org-present
  :config
  (add-hook 'org-present-mode-hook 'ad/org-present-start)
  (add-hook 'org-present-mode-quit-hook 'ad/org-present-end))
#+end_src

*** tree-slide
    #+begin_src emacs-lisp :tangle emacs/.emacs.d/init.el
    (use-package org-tree-slide)
    #+end_src

** graphviz
#+begin_src emacs-lisp :tangle emacs/.emacs.d/init.el
  (use-package graphviz-dot-mode
    :ensure t
    :config
    (setq graphviz-dot-indent-width 4))
#+end_src


* Chat
** irc
Basic erc setup
#+begin_src emacs-lisp :tangle emacs/.emacs.d/init.el
  (use-package erc
    :commands erc
    :config
    (setq
     erc-server "irc.libera.chat"
     erc-nick "amccart"
     erc-user-full-name "Adam McCartney"
     erc-track-shorten-start 8
     erc-auto-join-channels '(("irc.libera.chat" "#emacs"))
     erc-kill-buffer-on-part t
     erc-auto-query 'bury
     erc-fill-function 'erc-fill-static
     erc-fill-static-center 20
     erc-track-exclude '("#emacs")
     erc-track-exclude-types '("JOIN" "NICK" "QUIT" "MODE" "AWAY")
     erc-track-exclude-server-buffer t))
#+end_src
* Documentation 
*** markdown 
#+begin_src emacs-lisp :tangle emacs/.emacs.d/init.el
(use-package markdown-mode
  :defer t
  :mode ("\\.md$" "\\.markdown$" "vimperator-.+\\.tmp$")
  :config
  (add-hook 'markdown-mode-hook
            (lambda ()
              (remove-hook 'fill-nobreak-predicate
                           'markdown-inside-link-p t)))
  (setf sentence-end-double-space nil
        markdown-indent-on-enter nil
        markdown-command
        "pandoc -f markdown -t html5 -s --self-contained --smart"))

#+end_src

* Completion & searching 
** ivy 
Includes a number of minimalist completion tools that make life a bit easier.
#+begin_src emacs-lisp :tangle emacs/.emacs.d/init.el
(use-package ivy
  :diminish
  :bind (("C-s" . swiper)
         :map ivy-minibuffer-map
         ("TAB" . ivy-alt-done)
         ("C-l" . ivy-alt-done)
         ("C-j" . ivy-next-line)
         ("C-k" . ivy-previous-line)
         :map ivy-switch-buffer-map
         ("C-k" . ivy-previous-line)
         ("C-l" . ivy-done)
         ("C-d" . ivy-switch-buffer-kill)
         :map ivy-reverse-i-search-map
         ("C-k" . ivy-previous-line)
         ("C-d" . ivy-reverse-i-search-kill))
  :config
  (ivy-mode 1))
#+end_src

** counsel
~M-x~ on steroids

#+begin_src emacs-lisp :tangle emacs/.emacs.d/init.el
(use-package counsel
  :bind (("M-x" . counsel-M-x)
         ("C-x b" . counsel-ibuffer)
         ("C-x C-f" . counsel-find-file)
         :map minibuffer-local-map
         ("C-r" . 'counsel-minibuffer-history)))
         
#+end_src

** ctags
#+begin_src emacs-lisp
    
(use-package ctags
  :init
  (global-set-key (kbd "M-.") #'ctags-find)
  (global-set-key (kbd "M-?") #'ctags-find-reference))

#+end_src

** YASnippet
   #+begin_src emacs-lisp :tangle emacs/.emacs.d/init.el
   (use-package yasnippet)
   #+end_src
