Emacs.org
** company
#+begin_src emacs-lisp :tangle emacs/.emacs.d/init.el
(use-package company
  :custom
  (company-idle-delay 0)
  (company-minimum-prefix-length 1)
  (company-tooltip-align-annotations t)
  (company-dabbrev-downcase nil)
  (company-dabbrev-other-buffers t) ; search buffers with the same major mode
  :hook
  (dashboard-after-initialize . global-company-mode)
  :config
  (add-to-list 'company-begin-commands 'backwards-delete-char-untabify)
  

  ;; Show YASnippet snippets in company

  (defun fk/company-backend-with-yas (backend)
    "Add ':with company-yasnippet' to the given company backend."
    (if (and (listp backend) (member 'company-yasnippet backend))
        backend
      (append (if (consp backend)
                  backend
                (list backend))
              '(:with company-yasnippet))))

  (defun fk/company-smart-snippets (fn command &optional arg &rest _)
    "Do not show yasnippet candidates after dot."
    ;;Source:
    ;;https://www.reddit.com/r/emacs/comments/7dnbxl/how_to_temporally_filter_companymode_candidates/
    (unless (when (and (equal command 'prefix) (> (point) 0))
              (let* ((prefix (company-grab-symbol))
                     (point-before-prefix (if (> (- (point) (length prefix) 1) 0)
                                              (- (point) (length prefix) 1)
                                            1))
                     (char (buffer-substring-no-properties point-before-prefix (1+ point-before-prefix))))
                (string= char ".")))
      (funcall fn command arg)))

  ;; TODO: maybe show snippets at first?
  (defun fk/company-enable-snippets ()
    "Enable snippet suggestions in company by adding ':with
company-yasnippet' to all company backends."
    (interactive)
    (setq company-backends (mapcar 'fk/company-backend-with-yas company-backends))
    (advice-add 'company-yasnippet :around 'fk/company-smart-snippets))

  (fk/company-enable-snippets))
#+end_src


** Dap Mode
Emacs Debug Adapter Protocol aka DAP Mode means we can debug programs. Pfff...what sort of a
shoddy developer needs a debugger, eh?!

The following config is from https://github.com/neppramod/java_emacs/blob/master/emacs-configuration.org

Below we will integrate dap-mode with dap-hydra. Dap-hydra shows keys you can use to enable various
options and jump through code at runtime. After we install dap-mode we will also install dap-java.

#+begin_src emacs-lisp :tangle emacs/.emacs.d/init.el
(use-package dap-mode
  :ensure t
  :after (lsp-mode)
  :functions dap-hydra/nil
  :config
  (require 'dap-java)
  :bind (:map lsp-mode-map
         ("<f5>" . dap-debug)
         ("M-<f5>" . dap-hydra))
  :hook ((dap-mode . dap-ui-mode)
    (dap-session-created . (lambda (&_rest) (dap-hydra)))
    (dap-terminated . (lambda (&_rest) (dap-hydra/nil)))))

#+end_src

** Treemacs
Treemacs provides UI elements used for LSP UI. M-9 shows error list. 

#+begin_src emacs-lisp :tangle emacs/.emacs.d/init.el
(use-package lsp-treemacs
  :after (lsp-mode treemacs)
  :ensure t
  :commands lsp-treemacs-errors-list
  :bind (:map lsp-mode-map
         ("M-9" . lsp-treemacs-errors-list)))

(use-package treemacs
  :ensure t
  :commands (treemacs)
  :after (lsp-mode))  
#+end_src


*** Treemacs evil
We are of course evil
#+begin_src emacs-lisp :tangle emacs/.emacs.d/init.el
  (use-package treemacs-evil)
#+end_src


*** Treemacs projectile
This will quickly add projectile projects to Treemacs
#+begin_src emacs-lisp :tangle emacs/.emacs.d/init.el
  (use-package treemacs-projectile)
#+end_src

** lsp
Haven't really got this running so smoothly yet, find nvim's lsp stuff
works a bit better out of the box. 
#+begin_src emacs-lisp :tangle emacs/.emacs.d/init.el
  (use-package lsp-mode
    :init 
    (setq lsp-keymap-prefix "C-c l")
    :hook ((python-mode . lsp)
           ((typescript-mode js2-mode web-mode) . lsp)
           (lsp-mode . lsp-enable-which-key-integration))
    :commands lsp)

  (use-package lsp-ui
    :after lsp
    :hook (lsp-mode . lsp-ui-mode)
    :config
    (setq lsp-ui-sideline-enable t)
    (lsp-ui-doc-show))

  (use-package lsp-ivy)

  (use-package which-key
    :init (which-key-mode)
    :diminish which-key-mode
    :config
   (setq which-key-idle-delay 1))
#+end_src

*** Language Servers
**** pyright

     #+begin_src emacs-lisp :tangle emacs/.emacs.d/init.el
     (use-package lsp-pyright
       :after lsp-mode
       :custom
       (lsp-pyright-auto-import-completions nil)
       (lsp-pyright-typechecking-mode "off")
       :ensure t
       :hook (python-mode . (lambda ()
                              (require 'lsp-pyright)
                              (lsp))))
     #+end_src

* Development
** projectile

Project organization 

#+begin_src emacs-lisp :tangle emacs/.emacs.d/init.el
 (use-package projectile
  :diminish projectile-mode
  :config (projectile-mode)
  :custom ((projectile-completion-system 'ivy))
  :bind-keymap
  ("C-c p" . projectile-command-map)
  :init
  ;; NOTE: Set this to the folder where you keep your Git repos!
  (when (file-directory-p "~/.local/src")
    (setq projectile-project-search-path '("~/.local/src" "~/Code" "~/.local/src/mdw")))
  (setq projectile-switch-project-action #'projectile-dired))

(use-package counsel-projectile
  :config (counsel-projectile-mode))
#+end_src

** Git
   
** Magit
Very nice interface for Git.    

#+begin_src emacs-lisp :tangle emacs/.emacs.d/init.el
(use-package magit
  :straight t
  :init (if (not (boundp 'project-switch-commands)) 
        (setq project-switch-commands nil))
  :custom
  (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))

(defun efs/lsp-mode-setup ()
  (setq lsp-headerline-breadcrumb-segments '(path-up-to-project file symbols))
  (lsp-headerline-breadcrumb-mode))

;;(use-package lsp-pyright
;;  :straight t 
;;  :hook (python-mode . (lambda ()
;;                          (require 'lsp-pyright)
;;                          (lsp)))) ;; or lsp-deferred

#+end_src

** Languages 
   
Various packages and dependencies that make working with certain
languages a bit easier.
   
*** gnuplot
We need to add a couple of packages related to gnuplot to get emacs to reconize it on the system.
I'm possibly adding redundency here, but who doesn't love a bit of redundency?!

#+begin_src emacs-lisp :tangle emacs/.emacs.d/init.el
  (use-package gnuplot-mode)
  (use-package gnuplot)
#+end_src

*** html

#+begin_src emacs-lisp :tangle emacs/.emacs.d/init.el
  (use-package web-mode
    :mode "(\\.\\(html?\\|ejs\\|tsx|jsx\\)\\'"
    :config
    (setq-default web-mode-code-indent-ofset 2)
    (setq-default web-mode-markup-indent-offset 2)
    (setq-default web-mode-attribute-indent-offset 2))
#+end_src
*** lisp

To access some functions such as first or second in elisp, common lisp is required.
This is used by org-mode dot. Not sure if this will cause conflicts.
#+begin_src emacs-lisp :tangle emacs/.emacs.d/init.el 
  (require 'cl-lib)
#+end_src
 
Add slime that uses the sbcl 
#+begin_src emacs-lisp :tangle emacs/.emacs.d/init.el
(use-package slime
  :init 
  (setq inferior-lisp-program "/usr/local/bin/sbcl"))
#+end_src

*** python
#+begin_src emacs-lisp :tangle emacs/.emacs.d/init.el
  (use-package python-mode
    :mode "\\.py\\'"
    :init
    (setq python-shell-interpreter "python3")
    :hook (python-mode . lsp-deferred)
    :config
    (setq python-indent-level 4))
#+end_src

**** pyvenv
#+begin_src emacs-lisp :tangle emacs/.emacs.d/init.el 
(use-package pyvenv
 :after python-mode)
#+end_src

**** pytest
#+begin_src emacs-lisp :tangle emacs/.emacs.d/init.el
  (use-package python-test
    :after python-mode)
#+end_src

*** typescript
#+begin_src emacs-lisp :tangle emacs/.emacs.d/init.el
(use-package typescript-mode
  :mode "\\.ts\\'"
  :hook (typescript-mode . lsp-deferred)
  :config
  (setq typescript-indent-level 2))
  
(defun dw/set-js-indentation ()
  (setq js-indent-level 2)
  (setq evil-shift-width js-indent-level)
  (setq-default tab-width 2))

(use-package js2-mode
  :mode "\\.jsx?\\'"
  :config
  ;; Use js2-mode for Node scripts
  (add-to-list 'magic-mode-alist '("#!/usr/bin/env node" . js2-mode))

  ;; Don't use built-in syntax checking
  (setq js2-mode-show-strict-warnings nil)

  ;; Set up proper indentation in JavaScript and JSON files
  (add-hook 'js2-mode-hook #'dw/set-js-indentation)
  (add-hook 'json-mode-hook #'dw/set-js-indentation))
#+end_src

*** scheme 
#+begin_src emacs-lisp :tangle emacs/.emacs.d/init.el

(use-package geiser
  :straight t
  :config
  (setq geiser-default-implementation 'guile)
  (setq geiser-active-implementations '(guile))
  (setq geiser-implementations-alist '(((regexp "\\.scm$") guile)))
  (setq geiser-guile-binary "/usr/bin/guile"))

(use-package geiser-guile
  :straight t)
#+end_src

Add guile and mit scheme
#+begin_src conf :tangle .config/debian/manifests/interpreters
guile-3.0
mit-scheme
#+end_src


*** Clojure
Just starting to experiment with the lispy goodness of clojure
#+begin_src conf :tangle .config/debian/manifests/interpreters
clojure
#+end_src

**** Installing 

**** Clojure mode
#+begin_src emacs-lisp :tangle emacs/.emacs.d/init.el
  (use-package clojure-mode
    :ensure t
    :mode (("\\.clj\\'" . clojure-mode)
            ("\\.edn\\'" . clojure-mode))
    :init
    (add-hook 'clojure-mode-hook #'subword-mode)           
    (add-hook 'clojure-mode-hook #'smartparens-mode)       
    (add-hook 'clojure-mode-hook #'rainbow-delimiters-mode)
    (add-hook 'clojure-mode-hook #'eldoc-mode)) 
    #+end_src

**** Cider 
#+begin_src emacs-lisp :tangle emacs/.emacs.d/init.el
  (use-package cider
    :ensure t
    :defer t)
#+end_src


