Emacs.org
**** Leiningen
project generator for clojure 
#+begin_src conf :tangle .config/debian/manifests/languagetools
leiningen
#+end_src


*** c
#+begin_src emacs-lisp :tangle emacs/.emacs.d/init.el
(use-package cc-mode
  :defer t
  :init
  (defun skeeto/c-hook ()
    (setf c-basic-offset 4)
    (c-set-offset 'case-label '+)
    (c-set-offset 'access-label '/)
    (c-set-offset 'label '/))
  :config
  (progn
    (define-key java-mode-map (kbd "C-x I") 'add-java-import)
    (add-hook 'c-mode-hook #'skeeto/c-hook)
    (add-hook 'c++-mode-hook #'skeeto/c-hook)
    (add-to-list 'c-default-style '(c-mode . "k&r"))
    (add-to-list 'c-default-style '(c++-mode . "k&r"))))

#+end_src

*** Go
#+begin_src emacs-lisp :tangle emacs/.emacs.d/init.el
(use-package go-mode
  :hook (go-mode . lsp-deferred))
#+end_src

#+begin_src emacs-lisp :tangle emacs/.emacs.d/init.el
(use-package ob-go)
#+end_src

*** x86 assembly 
#+begin_src emacs-lisp
    
(use-package nasm-mode
  :defer t
  :mode ("\\.nasm$" "\\.asm$" "\\.s$")
  :config
  (add-hook 'nasm-mode-hook (lambda () (setf indent-tabs-mode t))))
  
(use-package asm-mode
  :defer t
  :init
  (add-hook 'asm-mode-hook (lambda () (setf indent-tabs-mode t
                                            tab-always-indent t))))

#+end_src

*** yaml
Everyone's favorite...
    #+begin_src emacs-lisp :tangle emacs/.emacs.d/init.el
    (use-package yaml-mode
       :mode "\\.ya?ml\\'")
    #+end_src
    


*** java

    #+begin_src emacs-lisp :tangle emacs/.emacs.d/init.el
      (use-package lsp-java
        :after lsp-mode
        :ensure t
        :config (add-hook 'java-mode-hook 'lsp))

    #+end_src

    
** Productivity
*** Flycheck
    #+begin_src emacs-lisp :tangle emacs/.emacs.d/init.el
    (use-package flycheck
      :defer t
      :hook (lsp-mode . flycheck-mode))
    #+end_src
*** Smart Parens 
    #+begin_src emacs-lisp :tangle emacs/.emacs.d/init.el
    (use-package smartparens
      :hook (prog-mode . smartparens-mode))
    #+end_src
** Editing Configuration
*** Use spaces instead of tabs for indentation 
   #+begin_src emacs-lisp :tangle emacs/.emacs.d/init.el
   (setq-default indent-tabs-mode nil)
   #+end_src
* Applications
** eshell
#+begin_src emacs-lisp
 
(use-package eshell
  :defer t
  :bind ([f1] . eshell-as)
  :init
  (setf eshell-directory-name (locate-user-emacs-file "local/eshell"))
  :config
  (add-hook 'eshell-mode-hook ; Bad, eshell, bad!
            (lambda ()
              (define-key eshell-mode-map (kbd "<f1>") #'quit-window))))
#+end_src


* web

** elfeed

Chris Wellon's elfeed package

#+begin_src emacs-lisp :tangle emacs/.emacs.d/init.el
  (use-package elfeed
    :ensure t)
#+end_src
