emacs/.emacs.d/init.el

(use-package cc-mode
  :defer t
  :init
  (defun skeeto/c-hook ()
    (setf c-basic-offset 4)
    (c-set-offset 'case-label '+)
    (c-set-offset 'access-label '/)
    (c-set-offset 'label '/))
  :config
  (progn
    (define-key java-mode-map (kbd "C-x I") 'add-java-import)
    (add-hook 'c-mode-hook #'skeeto/c-hook)
    (add-hook 'c++-mode-hook #'skeeto/c-hook)
    (add-to-list 'c-default-style '(c-mode . "k&r"))
    (add-to-list 'c-default-style '(c++-mode . "k&r"))))

(use-package go-mode
  :hook (go-mode . lsp-deferred))

(use-package ob-go)

(use-package yaml-mode
   :mode "\\.ya?ml\\'")

(use-package lsp-java
  :after lsp-mode
  :ensure t
  :config (add-hook 'java-mode-hook 'lsp))

(use-package flycheck
  :defer t
  :hook (lsp-mode . flycheck-mode))

(use-package smartparens
  :hook (prog-mode . smartparens-mode))

(setq-default indent-tabs-mode nil)
